---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
BuiltInFailures..::..MatchlineFailures Members
BuiltInFailures..::..MatchlineFailures Class Properties See Also Send Feedback
---

Provides a container of all Revit built-in FailureDefinitionId instances.

The BuiltInFailures..::..MatchlineFailures type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | CreationFailed | Matchline top extent should be higher than its bottom. |

# See Also

BuiltInFailures..::..MatchlineFailures Class

Autodesk.Revit.DB Namespace